app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "background", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new article with time"], ["text", "newest image"], ["background", "favicon.png"], ["created_at", "2015-02-23 00:26:43.646898"], ["updated_at", "2015-02-23 00:26:43.646898"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save